4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_csi.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_csi.c
  * @author  MCD Application Team
  * @brief   CSI HAL module driver
  *          This file provides firmware functions to manage the following
  *          functionalities of the Digital Camera Interface (CSI) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State and Error functions
  *
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================


  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2021 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */
/** @defgroup CSI CSI
  * @brief CSI HAL module driver
  * @{
  */

#ifdef HAL_CSI_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
#define VC0_IT (CSI_IER0_LB0IE | CSI_IER0_TIM0IE | CSI_IER0_SOF0IE | CSI_IER0_EOF0IE)
#define VC1_IT (CSI_IER0_LB1IE | CSI_IER0_TIM1IE | CSI_IER0_SOF1IE | CSI_IER0_EOF1IE)
#define VC2_IT (CSI_IER0_LB2IE | CSI_IER0_TIM2IE | CSI_IER0_SOF2IE | CSI_IER0_EOF2IE)
#define VC3_IT (CSI_IER0_LB3IE | CSI_IER0_TIM3IE | CSI_IER0_SOF3IE | CSI_IER0_EOF3IE)

/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/** @defgroup CSI_Exported_Functions CSI Exported Functions
  * @{
  */

/** @defgroup CSI_Exported_Functions_Group1 Initialization and Configuration functions
 *  @brief   Initialization and Configuration functions
 *
@verbatim
 ===============================================================================
                ##### Initialization and Configuration functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Initialize and configure the CSI
      (+) De-initialize the CSI

@endverbatim
  * @{
  */

/*
 * Table of hsfreqrange & osc_freq_target for the Synopsis D-PHY
 */
struct SNPS_Freqs {
  uint32_t hsfreqrange;
  uint32_t osc_freq_target;
} SNPS_Freqs [] = {
  { 0x00U, 460U },	/* HAL_CSI_BT_80 */
  { 0x10U, 460U },	/* HAL_CSI_BT_90 */
  { 0x20U, 460U },	/* HAL_CSI_BT_100 */
  { 0x30U, 460U },	/* HAL_CSI_BT_110 */
  { 0x01U, 460U },	/* HAL_CSI_BT_120 */
  { 0x11U, 460U },	/* HAL_CSI_BT_130 */
  { 0x21U, 460U },	/* HAL_CSI_BT_140 */
  { 0x31U, 460U },	/* HAL_CSI_BT_150 */
  { 0x02U, 460U },	/* HAL_CSI_BT_160 */
  { 0x12U, 460U },	/* HAL_CSI_BT_170 */
  { 0x22U, 460U },	/* HAL_CSI_BT_180 */
  { 0x32U, 460U },	/* HAL_CSI_BT_190 */
  { 0x03U, 460U },	/* HAL_CSI_BT_205 */
  { 0x13U, 460U },	/* HAL_CSI_BT_220 */
  { 0x23U, 460U },	/* HAL_CSI_BT_235 */
  { 0x33U, 460U },	/* HAL_CSI_BT_250 */
  { 0x04U, 460U },	/* HAL_CSI_BT_275 */
  { 0x14U, 460U },	/* HAL_CSI_BT_300 */
  { 0x25U, 460U },	/* HAL_CSI_BT_325 */
  { 0x35U, 460U },	/* HAL_CSI_BT_350 */
  { 0x05U, 460U },	/* HAL_CSI_BT_400 */
  { 0x16U, 460U },	/* HAL_CSI_BT_450 */
  { 0x26U, 460U },	/* HAL_CSI_BT_500 */
  { 0x37U, 460U },	/* HAL_CSI_BT_550 */
  { 0x07U, 460U },	/* HAL_CSI_BT_600 */
  { 0x18U, 460U },	/* HAL_CSI_BT_650 */
  { 0x28U, 460U },	/* HAL_CSI_BT_700 */
  { 0x39U, 460U },	/* HAL_CSI_BT_750 */
  { 0x09U, 460U },	/* HAL_CSI_BT_800 */
  { 0x19U, 460U },	/* HAL_CSI_BT_850 */
  { 0x29U, 460U },	/* HAL_CSI_BT_900 */
  { 0x3AU, 460U },	/* HAL_CSI_BT_950 */
  { 0x0AU, 460U },	/* HAL_CSI_BT_1000 */
  { 0x1AU, 460U },	/* HAL_CSI_BT_1050 */
  { 0x2AU, 460U },	/* HAL_CSI_BT_1100 */
  { 0x3BU, 460U },	/* HAL_CSI_BT_1150 */
  { 0x0BU, 460U },	/* HAL_CSI_BT_1200 */
  { 0x1BU, 460U },	/* HAL_CSI_BT_1250 */
  { 0x2BU, 460U },	/* HAL_CSI_BT_1300 */
  { 0x3CU, 460U },	/* HAL_CSI_BT_1350 */
  { 0x0CU, 460U },	/* HAL_CSI_BT_1400 */
  { 0x1CU, 460U },	/* HAL_CSI_BT_1450 */
  { 0x2CU, 460U },	/* HAL_CSI_BT_1500 */
  { 0x3DU, 285U },	/* HAL_CSI_BT_1550 */
  { 0x0DU, 295U },	/* HAL_CSI_BT_1600 */
  { 0x1DU, 304U },	/* HAL_CSI_BT_1650 */
  { 0x2EU, 313U },	/* HAL_CSI_BT_1700 */
  { 0x3EU, 322U },	/* HAL_CSI_BT_1750 */
  { 0x0EU, 331U },	/* HAL_CSI_BT_1800 */
  { 0x1EU, 341U },	/* HAL_CSI_BT_1850 */
  { 0x2FU, 350U },	/* HAL_CSI_BT_1900 */
  { 0x3FU, 359U },	/* HAL_CSI_BT_1950 */
  { 0x0FU, 368U },	/* HAL_CSI_BT_2000 */
  { 0x40U, 377U },	/* HAL_CSI_BT_2050 */
  { 0x41U, 387U },	/* HAL_CSI_BT_2100 */
  { 0x42U, 396U },	/* HAL_CSI_BT_2150 */
  { 0x43U, 405U },	/* HAL_CSI_BT_2200 */
  { 0x44U, 414U },	/* HAL_CSI_BT_2250 */
  { 0x45U, 423U },	/* HAL_CSI_BT_2300 */
  { 0x46U, 432U },	/* HAL_CSI_BT_2350 */
  { 0x47U, 442U },	/* HAL_CSI_BT_2400 */
  { 0x48U, 451U },	/* HAL_CSI_BT_2450 */
  { 0x49U, 460U },	/* HAL_CSI_BT_2500 */
};

/**
  * @brief  Write register into the D-PHY via the Test registers
  * @param  pHcsi pointer to a CSI_HandleTypeDef structure that contains
  *               the configuration information for CSI.
  * @retval HAL status
  */
void HAL_CSI_WritePHYReg(CSI_HandleTypeDef *pHcsi, uint32_t reg_msb, uint32_t reg_lsb, uint32_t val)
{
  /* Based on sequence described at section 5.2.3.2 of DesignWave document */
  /* For writing the 4-bit testcode MSBs */
  /* Set testen to high */
  __HAL_CSI_SET_REG(pHcsi, PTCR1, CSI_PTCR1_TWM);

  /* Set testclk to high */
  __HAL_CSI_SET_REG(pHcsi, PTCR0, CSI_PTCR0_TCKEN);

  /* Place 0x00 in testdin */
  __HAL_CSI_SET_REG(pHcsi, PTCR1, CSI_PTCR1_TWM);

  /* Set testclk to low (with the falling edge on testclk, the testdin signal content is latched internally) */
  __HAL_CSI_SET_REG(pHcsi, PTCR0, 0x00);

  /* Set testen to low */
  __HAL_CSI_SET_REG(pHcsi, PTCR1, 0x00);

  /* Place the 8-bit word corresponding to the testcode MSBs in testdin */
  __HAL_CSI_SET_REG(pHcsi, PTCR1, reg_msb & 0xffU);

  /* Set testclk to high */
  __HAL_CSI_SET_REG(pHcsi, PTCR0, CSI_PTCR0_TCKEN);

  /* For writing the 8-bit testcode LSBs */
  /* Set testclk to low */
  __HAL_CSI_SET_REG(pHcsi, PTCR0, 0x00);

