4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_csi.c
  /* Set testen to high */
  __HAL_CSI_SET_REG(pHcsi, PTCR1, CSI_PTCR1_TWM);

  /* Set testclk to high */
  __HAL_CSI_SET_REG(pHcsi, PTCR0, CSI_PTCR0_TCKEN);

  /* Place the 8-bit word test data in testdin */
  __HAL_CSI_SET_REG(pHcsi, PTCR1, CSI_PTCR1_TWM | (reg_lsb & 0xffU));

  /* Set testclk to low (with the falling edge on testclk, the testdin signal content is latched internally) */
  __HAL_CSI_SET_REG(pHcsi, PTCR0, 0x00);

  /* Set testen to low */
  __HAL_CSI_SET_REG(pHcsi, PTCR1, 0x00);

  /* For writing the data */
  /* Place the 8-bit word corresponding to the page offset in testdin */
  __HAL_CSI_SET_REG(pHcsi, PTCR1, val & 0xffU);

  /* Set testclk to high (test data is programmed internally */
  __HAL_CSI_SET_REG(pHcsi, PTCR0, CSI_PTCR0_TCKEN);

  /* Finish by setting testclk to low */
  __HAL_CSI_SET_REG(pHcsi, PTCR0, 0x00);
}

/**
  * @brief  Initializes the CSI according to the specified
  *         parameters in the CSI_InitTypeDef and create the associated handle.
  * @param  pHcsi pointer to a CSI_HandleTypeDef structure that contains
  *                  the configuration information for CSI.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CSI_Init(CSI_HandleTypeDef *pHcsi)
{
  uint32_t nb_lanes;

  /* Check pointer validity */
  if (pHcsi == NULL)
  {
    return HAL_ERROR;
  }

#if (USE_HAL_CSI_REGISTER_CALLBACKS == 1)

#else
  /* Check HAL state */
  if (pHcsi->State == HAL_CSI_STATE_RESET)
  {
    /* Init the low level hardware */
    HAL_CSI_MspInit(pHcsi);
  }
#endif /* USE_HAL_CSI_REGISTER_CALLBACKS */

  /* Ensure the CSI is disabled */
  __HAL_CSI_CLEAR_BIT(pHcsi, CR, CSI_CR_CSIEN);

  /* Configure the Lane Merger */
  if ((pHcsi->Init.LaneMerger.PhysicalLane0_Status == HAL_CSI_LANE_ENABLED) &&
      (pHcsi->Init.LaneMerger.PhysicalLane1_Status == HAL_CSI_LANE_ENABLED))
  {
    nb_lanes = HAL_CSI_LM_DUAL_LANE;
  }
  else if ((pHcsi->Init.LaneMerger.PhysicalLane0_Status == HAL_CSI_LANE_DISABLED) &&
           (pHcsi->Init.LaneMerger.PhysicalLane1_Status == HAL_CSI_LANE_DISABLED))
  {
    /* This case doesn't make any sense */
    return HAL_ERROR;
  }
  else
  {
    nb_lanes = HAL_CSI_LM_SINGLE_LANE;
  }

  /* Check Lane Merger configuration - mapping can be either LANE0 or LANE1
   and cannot be same for both physical lanes */
  if (((pHcsi->Init.LaneMerger.PhysicalLane0_Mapping != HAL_CSI_LM_LOGIC_LANE0) &&
       (pHcsi->Init.LaneMerger.PhysicalLane0_Mapping != HAL_CSI_LM_LOGIC_LANE1)) ||
      ((pHcsi->Init.LaneMerger.PhysicalLane1_Mapping != HAL_CSI_LM_LOGIC_LANE0) &&
       (pHcsi->Init.LaneMerger.PhysicalLane1_Mapping != HAL_CSI_LM_LOGIC_LANE1)) ||
      (pHcsi->Init.LaneMerger.PhysicalLane0_Mapping == pHcsi->Init.LaneMerger.PhysicalLane1_Mapping))
  {
    return HAL_ERROR;
  }

  __HAL_CSI_SET_REG(pHcsi, LMCFGR, nb_lanes |
                    ((pHcsi->Init.LaneMerger.PhysicalLane0_Mapping) << CSI_LMCFGR_DL0MAP_Pos) |
                    ((pHcsi->Init.LaneMerger.PhysicalLane1_Mapping) << CSI_LMCFGR_DL1MAP_Pos));

  /* Configure the watchdog counter */
  __HAL_CSI_SET_REG(pHcsi, WDR, pHcsi->Init.WatchdogCnt & CSI_WDR_CNT_Msk);

  /* Enable the CSI */
  __HAL_CSI_SET_BIT(pHcsi, CR, CSI_CR_CSIEN);

  /* Enable some interrupts, not related to virtual channels - all error cases */
  __HAL_CSI_ENABLE_IT(pHcsi, CSI_IER0_SYNCERRIE | CSI_IER0_WDERRIE |
                      CSI_IER0_SPKTERRIE | CSI_IER0_IDERRIE |
                      CSI_IER0_CECCERRIE | CSI_IER0_ECCERRIE |
                      CSI_IER0_CRCERRIE | CSI_IER0_SPKTIE |
                      CSI_IER0_CCFIFOFIE);

  if (pHcsi->Init.LaneMerger.PhysicalLane0_Status == HAL_CSI_LANE_ENABLED)
  {
    __HAL_CSI_ENABLE_PHY_IT(pHcsi, CSI_IER1_ESOTDL0IE | CSI_IER1_ESOTSYNCDL0IE |
                            CSI_IER1_EESCDL0IE | CSI_IER1_ESYNCESCDL0IE |
                            CSI_IER1_ECTRLDL0IE);
  }

  if (pHcsi->Init.LaneMerger.PhysicalLane1_Status == HAL_CSI_LANE_ENABLED)
  {
    __HAL_CSI_ENABLE_PHY_IT(pHcsi, CSI_IER1_ESOTDL1IE | CSI_IER1_ESOTSYNCDL1IE |
                            CSI_IER1_EESCDL1IE | CSI_IER1_ESYNCESCDL1IE |
                            CSI_IER1_ECTRLDL1IE);
  }

  /* Start D-PHY Configuration - based on DesignWare spec, section 5.2.4.1 */
  /* Stop the D-PHY */
  __HAL_CSI_CLEAR_BIT(pHcsi, PRCR, CSI_PRCR_PEN);

  /* Get the D-PHY enabledb but with all lanes disabled */
  __HAL_CSI_SET_REG(pHcsi, PCR, 0x00);

  /* Set the testclk (clock enable) on during 15ns */
  __HAL_CSI_SET_REG(pHcsi, PTCR0, CSI_PTCR0_TCKEN);

  HAL_Delay(1);

  __HAL_CSI_SET_REG(pHcsi, PTCR0, 0x00);

  /* Set hsfreqrange */
  __HAL_CSI_SET_REG(pHcsi, PFCR, (0x28U << CSI_PFCR_CCFR_Pos) |
                    (SNPS_Freqs[pHcsi->Init.PhyBitrate].hsfreqrange << CSI_PFCR_HSFR_Pos));

  /* set reg @08 deskew_polarity_rw 1'b1 */
  HAL_CSI_WritePHYReg(pHcsi, 0x00, 0x08, 0x38);

  /* set reg @0xE4 counter_for_des_en_config_if_rx 0x10 + DLL prog EN */
  /* This is because 13<= cfgclkfreqrange[5:0]<=38 */
  HAL_CSI_WritePHYReg(pHcsi, 0x00, 0xe4, 0x11);

  /* set reg @0xe3 & reg @0xe2 value DLL target oscilation freq */
  /* Based on the table page 77, osc_freq_target */
  HAL_CSI_WritePHYReg(pHcsi, 0x00, 0xe3,
		      SNPS_Freqs[pHcsi->Init.PhyBitrate].osc_freq_target >> 8);
  HAL_CSI_WritePHYReg(pHcsi, 0x00, 0xe3,
		      SNPS_Freqs[pHcsi->Init.PhyBitrate].osc_freq_target & 0xFFU);

  /* set basedir_0 to RX - Christophe DLD 0 RX, 1 TX. Synopsys 1 RX 0 TX  + freq range */
  __HAL_CSI_SET_REG(pHcsi, PFCR, (0x28U << CSI_PFCR_CCFR_Pos) |
                    (SNPS_Freqs[pHcsi->Init.PhyBitrate].hsfreqrange << CSI_PFCR_HSFR_Pos) | CSI_PFCR_DLD);

  /* Enable the D-PHY_RX lane(s) etc */
  __HAL_CSI_SET_REG(pHcsi, PCR,
                    ((pHcsi->Init.LaneMerger.PhysicalLane0_Status == HAL_CSI_LANE_ENABLED) ?
                     (uint32_t)CSI_PCR_DL0EN : 0U) |
                    ((pHcsi->Init.LaneMerger.PhysicalLane1_Status == HAL_CSI_LANE_ENABLED) ?
                     (uint32_t)CSI_PCR_DL1EN : 0U) |
                    CSI_PCR_CLEN);

  /* Enable the D-PHY_RX lane(s) etc */
  __HAL_CSI_SET_REG(pHcsi, PCR,
                    ((pHcsi->Init.LaneMerger.PhysicalLane0_Status == HAL_CSI_LANE_ENABLED) ? 
                     (uint32_t)CSI_PCR_DL0EN : 0U) |
                    ((pHcsi->Init.LaneMerger.PhysicalLane1_Status == HAL_CSI_LANE_ENABLED) ? 
                     (uint32_t)CSI_PCR_DL1EN : 0U) |
                    CSI_PCR_CLEN | CSI_PCR_PWRDOWN);

  /* Enable PHY, out of reset */
  __HAL_CSI_SET_BIT(pHcsi, PRCR, CSI_PRCR_PEN);

  /* Remove the force */
  __HAL_CSI_SET_REG(pHcsi, PMCR, 0x00);

  /* Change the CSI state */
  pHcsi->State = HAL_CSI_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  De-initializes the CSI peripheral registers to their default reset
  *         values.
  * @param  pHcsi pointer to a CSI_HandleTypeDef structure that contains
  *               the configuration information for CSI.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CSI_DeInit(CSI_HandleTypeDef *pHcsi)
{
  /* Check pointer validity */
  if (pHcsi == NULL)
  {
    return HAL_ERROR;
  }

  /* PowerDown the D-PHY_RX lane(s) etc */
  __HAL_CSI_SET_REG(pHcsi, PCR, 0);

  /* Disable some interrupts, not related to virtual channels - all error cases */
  __HAL_CSI_DISABLE_IT(pHcsi, CSI_IER0_SYNCERRIE | CSI_IER0_WDERRIE |
                       CSI_IER0_SPKTERRIE | CSI_IER0_IDERRIE |
                       CSI_IER0_CECCERRIE | CSI_IER0_ECCERRIE |
                       CSI_IER0_CRCERRIE);
  __HAL_CSI_DISABLE_PHY_IT(pHcsi, CSI_IER1_ESOTDL0IE | CSI_IER1_ESOTSYNCDL0IE |
                           CSI_IER1_EESCDL0IE | CSI_IER1_ESYNCESCDL0IE |
                           CSI_IER1_ECTRLDL0IE | CSI_IER1_ESOTDL1IE |
                           CSI_IER1_ESOTSYNCDL1IE | CSI_IER1_EESCDL1IE |
                           CSI_IER1_ESYNCESCDL1IE | CSI_IER1_ECTRLDL1IE);

  /* Disable the CSI */
  __HAL_CSI_CLEAR_BIT(pHcsi, CR, CSI_CR_CSIEN);

