4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_csi.c
  /* Initialize the CSI state*/
  pHcsi->State = HAL_CSI_STATE_RESET;

#if (USE_HAL_CSI_REGISTER_CALLBACKS == 1)
  if (pHcsi->MspDeInitCallback == NULL)
  {
    pHcsi->MspDeInitCallback = HAL_CSI_MspDeInit;
  }

  /* DeInit the low level hardware */
  pHcsi->MspDeInitCallback(pHcsi);
#else
  /* DeInit the low level hardware */
  HAL_CSI_MspDeInit(pHcsi);
#endif /* USE_HAL_DCMI_REGISTER_CALLBACKS */

  return HAL_OK;
}

/**
  * @brief  Configure a virtual channel of the CSI (filtering)
  * @param  pHcsi pointer to a CSI_HandleTypeDef structure
  * @param  vchan ID of the virtual channel to configure (0..3)
  * @param  Config pointer to a CSI_VirtualChannelConfigTypeDef structure
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CSI_ConfigVirtualChan(CSI_HandleTypeDef *pHcsi, uint32_t vchan,
                                            CSI_VirtualChannelConfigTypeDef *Config)
{
  uint32_t cfgr1 = 0;
  uint32_t cfgr2 = 0;
  uint32_t cfgr3 = 0;
  uint32_t cfgr4 = 0;
  struct dt_cfg
  {
    uint32_t *reg;
    uint32_t offset;
  } DTCFG[HAL_CSI_DATATYPE_NB] =
  {
    { &cfgr1, 16 }, /* DT0 */
    { &cfgr2, 0 },  /* DT1 */
    { &cfgr2, 16 }, /* DT2 */
    { &cfgr3, 0 },  /* DT3 */
    { &cfgr3, 16 }, /* DT4 */
    { &cfgr4, 0 },  /* DT5 */
    { &cfgr4, 16 }, /* DT6 */
  };

  /* Check pointer and input values validity */
  if ((pHcsi == NULL) || (Config == NULL) || (vchan >= HAL_CSI_VIRTUAL_CHANNEL_NB))
  {
    return HAL_ERROR;
  }


  /* Handle the ALLDT case first */
  if (Config->NoDataTypeFiltering == 1U)
  {
    cfgr1 = ((uint32_t)Config->CommonDataTypeFormat << CSI_VC0CFGR1_CDTFT_Pos) | CSI_VC0CFGR1_ALLDT;
  }
  else
  {
    uint32_t i;
    for (i = 0U; i < HAL_CSI_DATATYPE_NB; i++)
    {
      if (Config->DataType[i].Enable == 0U)
      {
        continue;
      }
      *(DTCFG[i].reg) |= (((uint32_t)Config->DataType[i].Class) << (DTCFG[i].offset)) | \
        		  ((uint32_t)Config->DataType[i].DataTypeFormat << (DTCFG[i].offset + 8U));
      cfgr1 |= (1UL << (CSI_VC0CFGR1_DT0EN_Pos + i));
    }
  }

  switch (vchan)
  {
    case 0:
      __HAL_CSI_SET_REG(pHcsi, VC0CFGR1, cfgr1);
      __HAL_CSI_SET_REG(pHcsi, VC0CFGR2, cfgr2);
      __HAL_CSI_SET_REG(pHcsi, VC0CFGR3, cfgr3);
      __HAL_CSI_SET_REG(pHcsi, VC0CFGR4, cfgr4);
      break;
    case 1:
      __HAL_CSI_SET_REG(pHcsi, VC1CFGR1, cfgr1);
      __HAL_CSI_SET_REG(pHcsi, VC1CFGR2, cfgr2);
      __HAL_CSI_SET_REG(pHcsi, VC1CFGR3, cfgr3);
      __HAL_CSI_SET_REG(pHcsi, VC1CFGR4, cfgr4);
      break;
    case 2:
      __HAL_CSI_SET_REG(pHcsi, VC2CFGR1, cfgr1);
      __HAL_CSI_SET_REG(pHcsi, VC2CFGR2, cfgr2);
      __HAL_CSI_SET_REG(pHcsi, VC2CFGR3, cfgr3);
      __HAL_CSI_SET_REG(pHcsi, VC2CFGR4, cfgr4);
      break;
    case 3:
      __HAL_CSI_SET_REG(pHcsi, VC3CFGR1, cfgr1);
      __HAL_CSI_SET_REG(pHcsi, VC3CFGR2, cfgr2);
      __HAL_CSI_SET_REG(pHcsi, VC3CFGR3, cfgr3);
      __HAL_CSI_SET_REG(pHcsi, VC3CFGR4, cfgr4);
      break;
  default:
    /* do something*/
    break;
  }

  return HAL_OK;
}

/**
  * @brief  Configure the LineByte triggers
  * @param  pHcsi pointer to a CSI_HandleTypeDef structure
  * @param  counter ID of the counter to configure (0..3)
  * @param  Config pointer to a CSI_LineByteCounterConfigTypeDef structure
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CSI_ConfigLineByteCounter(CSI_HandleTypeDef *pHcsi, uint32_t counter,
                                                const CSI_LineByteCounterConfigTypeDef *Config)
{
  uint32_t conf_reg = 0x00;
  uint32_t reg;
  struct
  {
    uint32_t vc_off;
    uint32_t en_off;
  }const lbxvc[HAL_CSI_COUNTER_NB] =
  {
    { CSI_PRGITR_LB0VC_Pos, CSI_PRGITR_LB0EN_Pos }, /* LB0 */
    { CSI_PRGITR_LB1VC_Pos, CSI_PRGITR_LB1EN_Pos }, /* LB1 */
    { CSI_PRGITR_LB2VC_Pos, CSI_PRGITR_LB2EN_Pos }, /* LB2 */
    { CSI_PRGITR_LB3VC_Pos, CSI_PRGITR_LB3EN_Pos }, /* LB3 */
  };

  /* Check pointer and input values validity */
  if ((pHcsi == NULL) || (Config == NULL) || (counter >= (uint32_t)HAL_CSI_COUNTER_NB))
  {
    return HAL_ERROR;
  }

  if (Config->Enable == 1U)
  {
    conf_reg = ((uint32_t)Config->LineCnt << CSI_LB0CFGR_LINECNT_Pos) | (uint32_t)Config->ByteCnt;
  }

  /* Stop the LineByte counter (if it is running) */
  reg = __HAL_CSI_GET_MASKED_REG(pHcsi, PRGITR, 0xffffffffU);
  reg &= ~(0x01U << lbxvc[counter].en_off);
  __HAL_CSI_SET_REG(pHcsi, PRGITR, reg);

  /* Apply the configuration */
  switch (counter)
  {
    case 0:
      __HAL_CSI_SET_REG(pHcsi, LB0CFGR, conf_reg);
      break;
    case 1:
      __HAL_CSI_SET_REG(pHcsi, LB1CFGR, conf_reg);
      break;
    case 2:
      __HAL_CSI_SET_REG(pHcsi, LB2CFGR, conf_reg);
      break;
    case 3:
      __HAL_CSI_SET_REG(pHcsi, LB3CFGR, conf_reg);
      break;
  default:
    /*do something*/
    break;
  }

  reg &= ~(0x03U << lbxvc[counter].vc_off);
  reg |= (Config->VC << lbxvc[counter].vc_off);
  __HAL_CSI_SET_REG(pHcsi, PRGITR, reg);

  reg |= (~~Config->Enable << lbxvc[counter].en_off);
  __HAL_CSI_SET_REG(pHcsi, PRGITR, reg);

  return HAL_OK;
}

/**
  * @brief  Configure the Timer triggers
  * @param  pHcsi pointer to a CSI_HandleTypeDef structure
  * @param  timer ID of the counter to configure (0..3)
  * @param  Config pointer to a CSI_TimerConfigTypeDef structure
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CSI_ConfigTimer(CSI_HandleTypeDef *pHcsi, uint32_t timer, const CSI_TimerConfigTypeDef *Config)
{
  uint32_t conf_reg = 0x00;
  uint32_t reg;
  struct
  {
    uint32_t vc_off;
    uint32_t start_off;
    uint32_t en_off;
  } const tim[HAL_CSI_TIMER_NB] =
  {
    { CSI_PRGITR_TIM0VC_Pos, CSI_PRGITR_TIM0EOF_Pos, CSI_PRGITR_TIM0EN_Pos }, /* TIM0 */
    { CSI_PRGITR_TIM1VC_Pos, CSI_PRGITR_TIM1EOF_Pos, CSI_PRGITR_TIM1EN_Pos }, /* TIM1 */
    { CSI_PRGITR_TIM2VC_Pos, CSI_PRGITR_TIM2EOF_Pos, CSI_PRGITR_TIM2EN_Pos }, /* TIM2 */
    { CSI_PRGITR_TIM3VC_Pos, CSI_PRGITR_TIM3EOF_Pos, CSI_PRGITR_TIM3EN_Pos }, /* TIM3 */
  };

  /* Check pointer and input values validity */
  if ((pHcsi == NULL) || (Config == NULL) || (timer >= (uint32_t)HAL_CSI_TIMER_NB))
  {
    return HAL_ERROR;
  }

  if (Config->Enable == 1U)
  {
    conf_reg = (Config->Count & CSI_TIM0CFGR_COUNT_Msk);
  }

