4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_csi.c
  /* Stop the timer (if it is running) */
  reg = __HAL_CSI_GET_MASKED_REG(pHcsi, PRGITR, 0xffffffffU);
  reg &= ~(0x01U << tim[timer].en_off);
  __HAL_CSI_SET_REG(pHcsi, PRGITR, reg);

  /* Apply the configuration */
  switch (timer)
  {
    case 0:
      __HAL_CSI_SET_REG(pHcsi, TIM0CFGR, conf_reg);
      break;
    case 1:
      __HAL_CSI_SET_REG(pHcsi, TIM1CFGR, conf_reg);
      break;
    case 2:
      __HAL_CSI_SET_REG(pHcsi, TIM2CFGR, conf_reg);
      break;
    case 3:
      __HAL_CSI_SET_REG(pHcsi, TIM3CFGR, conf_reg);
      break;
  default:
    /* do something*/
    break;
  }

  reg &= ~((0x03U << tim[timer].vc_off) | (0x01U << tim[timer].start_off));
  reg |= ((Config->VC << tim[timer].vc_off) | (Config->Start << tim[timer].start_off));
  __HAL_CSI_SET_REG(pHcsi, PRGITR, reg);

  reg |= (~~Config->Enable << tim[timer].en_off);
  __HAL_CSI_SET_REG(pHcsi, PRGITR, reg);

  return HAL_OK;
}

/**
* @brief  Initializes the CSI MSP.
* @param  pHcsi pointer to a CSI_HandleTypeDef structure that contains
*               the configuration information for CSI.
* @retval None
*/
__weak void HAL_CSI_MspInit(CSI_HandleTypeDef *pHcsi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pHcsi);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_CSI_MspInit could be implemented in the user file
   */
}

/**
* @brief  De-Initializes the CSI MSP.
* @param  pHcsi pointer to a CSI_HandleTypeDef structure that contains
*               the configuration information for CSI.
* @retval None
*/
__weak void HAL_CSI_MspDeInit(CSI_HandleTypeDef *pHcsi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pHcsi);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_CSI_MspInit could be implemented in the user file
   */
}
/**
  * @}
  */

/** @defgroup CSI_Exported_Functions_Group2 Start/Stop functions
 *  @brief   Function handling the start/stop of the CSI Virtual Channel processing
 *
@verbatim
 ===============================================================================
                ##### Start/Stop functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Start the processing of a virtual channel
      (+) Stop the processing of a virtual channel

@endverbatim
  * @{
  */
/**
  * @brief  Start the processing of one or sereval virtual channels
  * @param  pHcsi pointer to a CSI_HandleTypeDef structure
  * @param  vchans one or more virtual channel to start
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CSI_Start(CSI_HandleTypeDef *pHcsi, uint32_t vchans)
{
  /* Check pointer validity */
  if (pHcsi == NULL)
  {
    return HAL_ERROR;
  }

  __HAL_CSI_SET_BIT(pHcsi, CR,
                    (((vchans & (uint32_t)HAL_CSI_VIRTUAL_CHANNEL_0)!=0U) ? (uint32_t)CSI_CR_VC0START : 0U) |
                    (((vchans & (uint32_t)HAL_CSI_VIRTUAL_CHANNEL_1)!=0U) ? (uint32_t)CSI_CR_VC1START : 0U) |
                    (((vchans & (uint32_t)HAL_CSI_VIRTUAL_CHANNEL_2)!=0U) ? (uint32_t)CSI_CR_VC2START : 0U) |
                    (((vchans & (uint32_t)HAL_CSI_VIRTUAL_CHANNEL_3)!=0U) ? (uint32_t)CSI_CR_VC3START : 0U));

  /* Enable Interrupts related to the Virtual Channel enabled */
  __HAL_CSI_ENABLE_IT(pHcsi,
                      (((vchans & (uint32_t)HAL_CSI_VIRTUAL_CHANNEL_0)!=0U) ? (uint32_t)VC0_IT : 0U) |
                      (((vchans & (uint32_t)HAL_CSI_VIRTUAL_CHANNEL_1)!=0U) ? (uint32_t)VC1_IT : 0U) |
                      (((vchans & (uint32_t)HAL_CSI_VIRTUAL_CHANNEL_2)!=0U) ? (uint32_t)VC2_IT : 0U) |
                      (((vchans & (uint32_t)HAL_CSI_VIRTUAL_CHANNEL_3)!=0U) ? (uint32_t)VC3_IT : 0U));

  /* Wait for the start of all requested virtual channels */
  while (__HAL_CSI_GET_MASKED_REG(pHcsi, SR0, ((vchans & HAL_CSI_ALL_VIRTUAL_CHANNELS) << CSI_SR0_VC0STATEF_Pos)) \
                                  != ((vchans & HAL_CSI_ALL_VIRTUAL_CHANNELS) << CSI_SR0_VC0STATEF_Pos))
  {
    HAL_Delay(1);
  }

  return HAL_OK;
}

/**
  * @brief  Stop the processing of one or sereval virtual channels
  * @param  pHcsi pointer to a CSI_HandleTypeDef structure
  * @param  vchans one or more virtual channel to stop
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CSI_Stop(CSI_HandleTypeDef *pHcsi, uint32_t vchans)
{
  /* Check pointer validity */
  if (pHcsi == NULL)
  {
    return HAL_ERROR;
  }

  __HAL_CSI_SET_BIT(pHcsi, CR,
                    (((vchans & (uint32_t)HAL_CSI_VIRTUAL_CHANNEL_0) != 0U) ? (uint32_t)CSI_CR_VC0STOP : 0U) |
                    (((vchans & (uint32_t)HAL_CSI_VIRTUAL_CHANNEL_1) != 0U) ? (uint32_t)CSI_CR_VC1STOP : 0U) |
                    (((vchans & (uint32_t)HAL_CSI_VIRTUAL_CHANNEL_2) != 0U) ? (uint32_t)CSI_CR_VC2STOP : 0U) |
                    (((vchans & (uint32_t)HAL_CSI_VIRTUAL_CHANNEL_3) != 0U) ? (uint32_t)CSI_CR_VC3STOP : 0U));

  /* Wait for the start of all requested virtual channels */
  while (__HAL_CSI_GET_MASKED_REG(pHcsi, SR0, (vchans & HAL_CSI_ALL_VIRTUAL_CHANNELS) << CSI_SR0_VC0STATEF_Pos)!=0U)
  {
    HAL_Delay(1);
  }

  return HAL_OK;
}
/**
  * @}
  */

/** @defgroup CSI_Exported_Functions_Group3 Callback functions
 *  @brief   Callback (event / error) functions
 *
@verbatim
 ===============================================================================
                ##### Callback functions #####
 ===============================================================================
    [..]  This section provides function called upon:
      (+) events triggered by the CSI
      (+) errors triggered by the CSI

@endverbatim
  * @{
  */
/**
  * @brief  CSI Error Event callback
  * @param  pHcsi pointer to a CSI_HandleTypeDef structure that contains
  *               the configuration information for CSI.
  * @param  error HAL_CSI_ErrorEventTypeDef type of the error
  * @param  arg0 argument (depend on error)
  * @param  arg1 argument (depend on error)
  * @retval None
  */
__weak void HAL_CSI_ErrorEventCallback(CSI_HandleTypeDef *pHcsi, HAL_CSI_ErrorEventTypeDef error,
                                       uint32_t arg0, uint32_t arg1)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_CSI_ErrorEventCallback could be implemented in the user file
   */
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pHcsi);
  UNUSED(error);
  UNUSED(arg0);
  UNUSED(arg1);
}

/**
  * @brief  CSI Event callback
  * @param  pHcsi pointer to a CSI_HandleTypeDef structure that contains
  *               the configuration information for CSI.
  * @param  event HAL_CSI_EventTypeDef type of the event
  * @param  arg0 argument (depend on event)
  * @param  arg1 argument (depend on event)
  * @retval None
  */
__weak void HAL_CSI_EventCallback(CSI_HandleTypeDef *pHcsi, HAL_CSI_EventTypeDef event, uint32_t arg0, uint32_t arg1)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_CSI_EventCallback could be implemented in the user file
   */
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pHcsi);
  UNUSED(event);
  UNUSED(arg0);
  UNUSED(arg1);
}
/**
  * @}
  */

/** @defgroup CSI_Exported_Functions_Group4 Peripheral State functions
 *  @brief    Peripheral State functions
 *
@verbatim
 ===============================================================================
               ##### Peripheral State and Errors functions #####
 ===============================================================================
    [..]
    This subsection provides functions allowing to
      (+) Check the CSI state.
      (+) Get the specific CSI error flag.

@endverbatim
  * @{
  */

/**
  * @brief  Return the CSI state
  * @param  pHcsi pointer to a CSI_HandleTypeDef structure that contains
  *               the configuration information for CSI.
  * @retval HAL state
  */
HAL_CSI_StateTypeDef HAL_CSI_GetState(const CSI_HandleTypeDef *pHcsi)
{
  return pHcsi->State;
}

/**
 * @brief  Return the CSI error code
 * @param  pHcsi  pointer to a CSI_HandleTypeDef structure that contains
 *              the configuration information for CSI.
 * @retval CSI Error Code
 */
uint32_t HAL_CSI_GetError(const CSI_HandleTypeDef *pHcsi)
{
  return pHcsi->ErrorCode;
}
/**
  * @}
  */

/** @defgroup CSI_Exported_Functions_Group5 IRQ handler function
 *  @brief   IRQ handler function
 *
@verbatim
 ===============================================================================
                ##### IRQ handler function #####
 ===============================================================================
    [..]  This section provides function allowing to:
      (+) Handle the various interrupts generated by the CSI IP

@endverbatim
  * @{
  */

/**
  * @brief  Handles CSI interrupt request.
  * @param  pHcsi pointer to a CSI_HandleTypeDef structure that contains
  *               the configuration information for the CSI.
  * @retval None
  */
typedef void (*irq_error_cb_t)(CSI_HandleTypeDef *pHcsim, HAL_CSI_ErrorEventTypeDef error,
                               uint32_t arg0, uint32_t arg1);
#define ARRAY_SIZE(arr) (sizeof(arr) / sizeof((arr)[0]))
#define CSI_SR0_ERROR_FLAGS (CSI_SR0_SYNCERRF | CSI_SR0_WDERRF | CSI_SR0_SPKTERRF | CSI_SR0_IDERRF | \
                              CSI_SR0_CECCERRF | CSI_SR0_ECCERRF | CSI_SR0_CRCERRF)
#define CSI_SR0_EVENTS_FLAGS (CSI_SR0_SPKTF | CSI_SR0_CCFIFOFF | CSI_SR0_EOF0F | CSI_SR0_EOF1F | CSI_SR0_EOF2F | \
                              CSI_SR0_EOF3F | CSI_SR0_SOF0F | CSI_SR0_SOF1F | CSI_SR0_SOF2F | CSI_SR0_SOF3F | \
                              CSI_SR0_TIM0F | CSI_SR0_TIM1F | CSI_SR0_TIM2F | CSI_SR0_TIM3F | CSI_SR0_LB0F | \
                              CSI_SR0_LB1F | CSI_SR0_LB2F | CSI_SR0_LB3F)
#define CSI_SR1_ERROR_FLAGS (CSI_SR1_ESOTDL0F | CSI_SR1_ESOTSYNCDL0F | CSI_SR1_EESCDL0F | CSI_SR1_ESYNCESCDL0F | \
                              CSI_SR1_ECTRLDL0F | CSI_SR1_ESOTDL1F | CSI_SR1_ESOTSYNCDL1F | CSI_SR1_EESCDL1F | \
                              CSI_SR1_ESYNCESCDL1F | CSI_SR1_ECTRLDL1F )
void HAL_CSI_IRQHandler(CSI_HandleTypeDef *pHcsi)
{
  CSI_TypeDef *regs = pHcsi->Instance;
  /* Structure containing information about each error interrupt */
  struct
  {
    uint32_t flag;
    uint32_t errorcode;
    HAL_CSI_ErrorEventTypeDef type;
    __IO uint32_t *arg_reg;
    uint32_t vchan_off;
    uint32_t data_type_off;
  } errors_sr0[] =
  {
    { CSI_SR0_SYNCERRF, HAL_CSI_ERROR_SYNC, HAL_CSI_SyncError, &(regs->ERR2), CSI_ERR2_SYNCVCERR_Pos, 0xFFFF },
    { CSI_SR0_WDERRF, HAL_CSI_ERROR_WDG, HAL_CSI_WatchdogError, &(regs->ERR2), CSI_ERR2_SYNCVCERR_Pos, 0xFFFF },
    { CSI_SR0_SPKTERRF, HAL_CSI_ERROR_SPKT, HAL_CSI_ShortPacketError, &(regs->ERR2), \
     CSI_ERR2_SPKTVCERR_Pos, CSI_ERR2_SPKTDTERR_Pos },
    { CSI_SR0_IDERRF, HAL_CSI_ERROR_DTID, HAL_CSI_DataTypeIDError, &(regs->ERR1), \
     CSI_ERR1_IDVCERR_Pos, CSI_ERR1_IDDTERR_Pos },
    { CSI_SR0_CECCERRF, HAL_CSI_ERROR_CECC, HAL_CSI_CECCError, &(regs->ERR1), \
     CSI_ERR1_CECCVCERR_Pos, CSI_ERR1_CECCDTERR_Pos},
    { CSI_SR0_ECCERRF, HAL_CSI_ERROR_ECC, HAL_CSI_ECCError, &(regs->ERR1), 0xFFFF, 0xFFFF },
    { CSI_SR0_CRCERRF, HAL_CSI_ERROR_CRC, HAL_CSI_CRCError, &(regs->ERR1), \
     CSI_ERR1_CRCVCERR_Pos, CSI_ERR1_CRCDTERR_Pos },
  };

  struct
  {
    uint32_t flag;
    uint32_t errorcode;
    HAL_CSI_ErrorEventTypeDef type;
    uint32_t lane;
  } errors_sr1[] =
  {
    { CSI_SR1_ESOTDL0F, HAL_CSI_ERROR_SOF, HAL_CSI_SOTError, 0},
    { CSI_SR1_ESOTSYNCDL0F, HAL_CSI_ERROR_SOFSYNC, HAL_CSI_SOTSynchroError, 0 },
    { CSI_SR1_EESCDL0F, HAL_CSI_ERROR_DPHY_ESC, HAL_CSI_EscapeEntryError, 0 },
    { CSI_SR1_ESYNCESCDL0F, HAL_CSI_ERROR_DPHY_LP_SYNC, HAL_CSI_LowPowerTXSynchroError, 0 },
    { CSI_SR1_ECTRLDL0F, HAL_CSI_ERROR_DPHY_CTRL, HAL_CSI_ControlError, 0 },
    { CSI_SR1_ESOTDL1F, HAL_CSI_ERROR_SOF, HAL_CSI_SOTError, 1 },
    { CSI_SR1_ESOTSYNCDL1F, HAL_CSI_ERROR_SOFSYNC, HAL_CSI_SOTSynchroError, 1 },
    { CSI_SR1_EESCDL1F, HAL_CSI_ERROR_DPHY_ESC, HAL_CSI_EscapeEntryError, 1 },
    { CSI_SR1_ESYNCESCDL1F, HAL_CSI_ERROR_DPHY_LP_SYNC, HAL_CSI_LowPowerTXSynchroError, 1 },
    { CSI_SR1_ECTRLDL1F, HAL_CSI_ERROR_DPHY_CTRL, HAL_CSI_ControlError, 1 },
  };

  /* Structure containing information about each virtual channel related interrupt */
  struct
  {
    uint32_t flag;
    HAL_CSI_EventTypeDef type;
    uint32_t arg0;
  } chans[] =
  {
    /* End of frame */
    { CSI_SR0_EOF0F, HAL_CSI_EndOfFrame, 0 },
    { CSI_SR0_EOF1F, HAL_CSI_EndOfFrame, 1 },
    { CSI_SR0_EOF2F, HAL_CSI_EndOfFrame, 2 },
    { CSI_SR0_EOF3F, HAL_CSI_EndOfFrame, 3 },
    /* Start of frame */
    { CSI_SR0_SOF0F, HAL_CSI_StartOfFrame, 0 },
    { CSI_SR0_SOF1F, HAL_CSI_StartOfFrame, 1 },
    { CSI_SR0_SOF2F, HAL_CSI_StartOfFrame, 2 },
    { CSI_SR0_SOF3F, HAL_CSI_StartOfFrame, 3 },
    /* Timer */
    { CSI_SR0_TIM0F, HAL_CSI_TimerEvent, 0 },
    { CSI_SR0_TIM1F, HAL_CSI_TimerEvent, 1 },
    { CSI_SR0_TIM2F, HAL_CSI_TimerEvent, 2 },
    { CSI_SR0_TIM3F, HAL_CSI_TimerEvent, 3 },
    /* Line Byte */
    { CSI_SR0_LB0F, HAL_CSI_LineByte, 0 },
    { CSI_SR0_LB1F, HAL_CSI_LineByte, 1 },
    { CSI_SR0_LB2F, HAL_CSI_LineByte, 2 },
    { CSI_SR0_LB3F, HAL_CSI_LineByte, 3 },
    /* Short Packet */
    { CSI_SR0_SPKTF, HAL_CSI_ShortPkt, 0 },
    /* Clock Changer FIFO Full */
    { CSI_SR0_CCFIFOFF, HAL_CSI_CCFifoFull, 0 },
  };
  uint32_t irq_status;
  uint32_t i;

  /* Should not be null at this stage : handle tested to avoid system crash */
  if (pHcsi == NULL)
  {
    return;
  }

  /* Read the SR0 register once */
  irq_status = __HAL_CSI_GET_MASKED_REG(pHcsi, SR0, CSI_SR0_ERROR_FLAGS | CSI_SR0_EVENTS_FLAGS);

