4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Src/stm32mp2xx_hal_csi.c
  /* Loop through all error interrupt sources */
  i = 0;
  while (((irq_status & (uint32_t)CSI_SR0_ERROR_FLAGS) != 0U) && ((i < (uint32_t)ARRAY_SIZE(errors_sr0)) != 0U))
  {
    if ((irq_status & (errors_sr0[i].flag)) != 0U)
    {
      uint32_t error_reg;
      uint32_t vchan = 0;
      uint32_t data_type = 0;

      __HAL_CSI_SET_BIT(pHcsi, FCR0, errors_sr0[i].flag);
      irq_status &= ~errors_sr0[i].flag;
      pHcsi->ErrorCode |= errors_sr0[i].errorcode;
      pHcsi->State = HAL_CSI_STATE_ERROR;

      error_reg = *(errors_sr0[i].arg_reg);

      if (errors_sr0[i].vchan_off != 0xFFFFU)
      {
        vchan = (error_reg >> errors_sr0[i].vchan_off) & 0x03U;
      }

      if (errors_sr0[i].data_type_off != 0xFFFFU)
      {
        data_type = (error_reg >> errors_sr0[i].data_type_off) & 0x3fU;
      }
      HAL_CSI_ErrorEventCallback(pHcsi, errors_sr0[i].type, vchan, data_type);
    }
    i++;
  }

  i = 0;
  /* Loop through all virtual channel interrupt sources */
  while (((irq_status & (uint32_t)CSI_SR0_EVENTS_FLAGS) != 0U) && ((i < (uint32_t)ARRAY_SIZE(chans)) != 0U))
  {
    if ((irq_status & (chans[i].flag) )!= 0U)
    {
      __HAL_CSI_SET_BIT(pHcsi, FCR0, chans[i].flag);
      irq_status &= ~chans[i].flag;
      if (chans[i].flag != CSI_SR0_SPKTF)
      {
        HAL_CSI_EventCallback(pHcsi, chans[i].type, chans[i].arg0, 0);
      }
      else
      {
        uint32_t tmp;
        tmp = __HAL_CSI_GET_MASKED_REG(pHcsi, SPDFR, 0xffffffffU);
        HAL_CSI_EventCallback(pHcsi, chans[i].type,
                              (tmp & CSI_SPDFR_VCHANNEL_Msk) >> CSI_SPDFR_VCHANNEL_Pos,
                              (tmp & (CSI_SPDFR_DATATYPE_Msk | CSI_SPDFR_DATAFIELD_Msk)));
      }
    }
    i++;
  }

  /* Read the SR1 register once */
  irq_status = __HAL_CSI_GET_MASKED_REG(pHcsi, SR1, CSI_SR1_ERROR_FLAGS);

  /* Loop through all error interrupt sources */
  i = 0;
  while ((irq_status != 0U) && (i < ARRAY_SIZE(errors_sr1)))
  {
    if ((irq_status & (errors_sr1[i].flag)) != 0U)
    {
      __HAL_CSI_SET_BIT(pHcsi, FCR1, errors_sr1[i].flag);
      irq_status &= ~errors_sr1[i].flag;
      pHcsi->ErrorCode |= errors_sr1[i].errorcode;
      pHcsi->State = HAL_CSI_STATE_ERROR;

      HAL_CSI_ErrorEventCallback(pHcsi, errors_sr1[i].type, errors_sr1[i].lane, 0);
    }
    i++;
  }
}
/**
  * @}
  */

#endif /* HAL_CSI_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
